mdmfile/src/Catalogs/мдмКомандыФорм/мдмКомандыФорм.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>мдмКомандыФорм</name>
  <owners>Catalog.мдмФормыДанных</owners>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>80</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Заголовок</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АлгоритмКлиент</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АлгоритмСервер</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеСсылки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИзменяетСохраняемыеДанные</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

mdmfile/src/Catalogs/мдмКомандыФорм/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НастройкаПодсказок();
	
КонецПроцедуры

&НаСервере
Процедура НастройкаПодсказок()
	
	Элементы.АлгоритмКлиент.РасширеннаяПодсказка.Заголовок = мдмКонструкторФормыКлиентСервер.ФорматированнаяСтрока(
		НСтр("ru = '<b>Клиентская часть алгоритма команды.</b>
		            |
					|<b>Контекст</b>:
					|	Форма - УправляемаяФорма - форма, в которой выполняется команда.
					|	Команда - Строка - имя выполняемой команды.'")	
		);
		
	Элементы.АлгоритмСервер.РасширеннаяПодсказка.Заголовок = мдмКонструкторФормыКлиентСервер.ФорматированнаяСтрока(
		НСтр("ru = '<b>Серверная часть алгоритма команды.</b>
		            |
					|<b>Контекст</b>:
					|	Форма - УправляемаяФорма - форма, в которой выполняется команда.
					|	Команда - Строка - имя выполняемой команды.'")	
		);
		
		
КонецПроцедуры
